<template>
  <v-dialog
    v-model="dialog"
  >
    <!--  確認ボタン -->
    <template #activator="{ on, attrs }">
      <v-btn
        v-bind="attrs"
        v-on="on"
        outlined
        text
        color="white"
      >
        <small>
          プライバシー
        </small>
      </v-btn>
    </template>
    <!--  /確認ボタン -->
    <!--  確認モーダル -->
    <v-card>
      <v-container>
        <div class="container mx-auto mt-6">
          <h1 class="mb-6 text-center">
            プライバシーポリシー
          </h1>
          <div class="content">
            <div>
              DigLive（以下、「当サイト」といいます。）は、本ウェブサイト上で提供するサービスにおけるユーザーの個人情報の取扱いについて、<br>
              以下のとおりプライバシーポリシーを定めます。
            </div>
            <div>
              <h3 class="my-4">
                お客様から取得する情報
              </h3>
              <p>当サイトは、お客様から以下の情報を取得します。</p>
              <ul>
                <li>氏名(ニックネームやペンネームも含む)</li>
                <li>メールアドレス</li>
                <li>Cookie(クッキー)を用いて生成された識別情報</li>
                <li>
                  OSが生成するID、端末の種類、端末識別子等のお客様が利用するOSや端末に関する情報
                </li>
                <li>
                  当サイトウェブサイトの滞在時間、入力履歴等の当サイトウェブサイトにおけるお客様の行動履歴
                </li>
                <li>当サイトアプリの起動時間、入力履歴等の当サイトアプリの利用履歴</li>
              </ul>
            </div>
            <div>
              <h3 class="my-4">
                お客様の情報を利用する目的
              </h3>
              <p>当サイトは、お客様から取得した情報を、以下の目的のために利用します。</p>
              <ul>
                <li>当サイトサービスに関する登録の受付、お客様の本人確認、認証のため</li>
                <li>お客様の当サイトサービスの利用履歴を管理するため</li>
                <li>市場分析、マーケティングのため</li>
                <li>お客様からのお問い合わせに対応するため</li>
                <li>当サイトの規約や法令に違反する行為に対応するため</li>
                <li>以上の他、当サイトサービスの提供、維持、保護及び改善のため</li>
              </ul>
            </div>
            <div>
              <h3 class="my-4">
                安全管理のために講じた措置
              </h3>
              <p>当サイトが、お客様から取得した情報に関して安全管理のために講じた措置につきましては、末尾記載のお問い合わせ先にご連絡をいただきましたら、法令の定めに従い個別にご回答させていただきます。</p>
            </div>
            <div>
              <h3 class="my-4">
                第三者提供
              </h3>
              <p>当サイトは、お客様から取得する情報のうち、個人データ（個人情報保護法第２条第６項）に該当するものついては、あらかじめお客様の同意を得ずに、第三者（日本国外にある者を含みます。）に提供しません。 但し、次の場合は除きます。</p>
              <ul>
                <li>個人データの取扱いを外部に委託する場合</li>
                <li>当サイトや当サイトサービスが買収された場合</li>
                <li>事業パートナーと共同利用する場合（具体的な共同利用がある場合は、その内容を別途公表します。）</li>
                <li>その他、法律によって合法的に第三者提供が許されている場合</li>
              </ul>
            </div>
            <div>
              <h3 class="my-4">
                アクセス解析ツール
              </h3>
              <p>当サイトは、お客様のアクセス解析のために、「Googleアナリティクス」を利用しています。Googleアナリティクスは、トラフィックデータの収集のためにCookieを使用しています。トラフィックデータは匿名で収集されており、個人を特定するものではありません。Cookieを無効にすれば、これらの情報の収集を拒否することができます。詳しくはお使いのブラウザの設定をご確認ください。Googleアナリティクスについて、詳しくは以下からご確認ください。 但し、次の場合は除きます。</p>
            </div>
            <div>
              <h3 class="my-4">
                プライバシーポリシーの変更
              </h3>
              <p>当サイトは、必要に応じて、このプライバシーポリシーの内容を変更します。この場合、変更後のプライバシーポリシーの施行時期と内容を適切な方法により周知または通知します。 但し、次の場合は除きます。</p>
            </div>
            <div>
              <h3 class="my-4">
                お問い合わせ
              </h3>
              <p>お客様の情報の開示、情報の訂正、利用停止、削除をご希望の場合は、管理者Twitterアカウントまでお願いいたします。</p>
            </div>
            <p class="text-right">
              以上
            </p>
          </div>
        </div>
        <!-- 閉じるフォーム -->
        <v-card-actions>
          <v-spacer />
          <v-btn
            color="primary"
            text
            @click="dialog = false"
          >
            閉じる
          </v-btn>
        </v-card-actions>
        <!-- /閉じるフォーム -->
      </v-container>
    </v-card>
    <!-- /確認モーダル -->
  </v-dialog>
</template>

<script>
export default {
  data () {
    return {
      dialog: false
    }
  }
}
</script>
